Revit 2027 API
RebarCoverType.Create Method
 Creates a new CoverType in the document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RebarCoverType Create(
	Document doc,
	string name,
	double coverDistance
)
Public Shared Function Create (
	doc As Document,
	name As String,
	coverDistance As Double
) As RebarCoverType
public:
static RebarCoverType^ Create(
	Document^ doc,
	String^ name,
	double coverDistance
)
static member Create :
        doc : Document *
        name : string *
        coverDistance : float -> RebarCoverType
Parameters
doc Document
name String
coverDistance Double
Return Value
RebarCoverType
Exceptions
Exception | Condition
ArgumentException |  name is an empty string.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  coverDistance cannot be negative.
See Also
Reference
RebarCoverType Class
Autodesk.Revit.DB.Structure Namespace